[["vocabulary", 1], ["grammar", 2], ["comprehension", 3], ["language", 4], ["vocab", 5], ["idioms", 6], ["lexicon", 7], ["Vocabulary", 8], ["vocabularies", 9], ["fluency", 10], ["phrases", 11], ["grammatical", 12], ["pronunciation", 13], ["dictionary", 14], ["terminology", 15], ["linguistic", 16], ["spelling", 17], ["verbs", 18], ["dictionaries", 19], ["thesaurus", 20], ["flashcards", 21], ["languages", 22], ["learning", 23], ["learners", 24], ["synonyms", 25], ["adjectives", 26], ["worksheets", 27], ["nouns", 28], ["lesson", 29], ["phonics", 30], ["definitions", 31], ["conversational", 32], ["sentences", 33], ["glossary", 34], ["meanings", 35], ["memorize", 36], ["idiom", 37], ["colloquial", 38], ["punctuation", 39], ["literacy", 40], ["phonetic", 41], ["word", 42], ["concepts", 43], ["rhyming", 44], ["idiomatic", 45], ["lexical", 46], ["memorization", 47], ["vernacular", 48], ["esl", 49], ["translate", 50], ["math", 51], ["words", 52], ["alphabet", 53], ["texts", 54], ["pronunciations", 55], ["proficiency", 56], ["phonetics", 57], ["lingo", 58], ["verb", 59], ["expressions", 60], ["diction", 61], ["antonyms", 62], ["metaphors", 63], ["dialect", 64], ["memorizing", 65], ["descriptive", 66], ["verbal", 67], ["curriculum", 68], ["Grammar", 69], ["phrase", 70], ["mastery", 71], ["syntax", 72], ["classroom", 73], ["worksheet", 74], ["jargon", 75], ["translating", 76], ["understanding", 77], ["concise", 78], ["fluently", 79], ["fluent", 80], ["slang", 81], ["explanations", 82], ["English", 83], ["literature", 84], ["skills", 85], ["linguistics", 86], ["learner", 87], ["lessons", 88], ["teaching", 89], ["semantic", 90], ["tenses", 91], ["geography", 92], ["meaning", 93], ["workbook", 94], ["spoken", 95], ["english", 96], ["contexts", 97], ["etymology", 98], ["spanish", 99], ["knowledge", 100], ["prepositions", 101], ["dialects", 102], ["grammer", 103], ["kanji", 104], ["repetition", 105], ["translation", 106], ["phrasing", 107], ["quizzes", 108], ["phonological", 109], ["discourse", 110], ["langauge", 111], ["syllables", 112], ["pronounciation", 113], ["pronouns", 114], ["Language", 115], ["homework", 116], ["mathematics", 117], ["context", 118], ["phonology", 119], ["phonemic", 120], ["textbook", 121], ["writing", 122], ["conceptual", 123], ["shorthand", 124], ["communicative", 125], ["syntactic", 126], ["analogies", 127], ["kindergarten", 128], ["learn", 129], ["text", 130], ["prose", 131], ["bilingual", 132], ["thematic", 133], ["quiz", 134], ["acronyms", 135], ["adverbs", 136], ["poetry", 137], ["basic", 138], ["poetic", 139], ["rhymes", 140], ["semantics", 141], ["reasoning", 142], ["translations", 143], ["memorized", 144], ["abbreviations", 145], ["teach", 146], ["mathematical", 147], ["Comprehension", 148], ["pedagogy", 149], ["rubric", 150], ["familiarity", 151], ["descriptions", 152], ["numeracy", 153], ["syllable", 154], ["sentence", 155], ["examples", 156], ["terms", 157], ["vowels", 158], ["Pronunciation", 159], ["grammars", 160], ["pedagogical", 161], ["metaphor", 162], ["literary", 163], ["synonym", 164], ["basics", 165], ["taxonomy", 166], ["rhyme", 167], ["textual", 168], ["comprehend", 169], ["phraseology", 170], ["algebra", 171], ["adjective", 172], ["understandable", 173], ["suffixes", 174], ["orthography", 175], ["expressive", 176], ["glossaries", 177], ["rhetorical", 178], ["syllabus", 179], ["phrasal", 180], ["introductory", 181], ["comprehending", 182], ["Dictionary", 183], ["skill", 184], ["elementary", 185], ["Verbs", 186], ["alliteration", 187], ["exercises", 188], ["mnemonics", 189], ["conjugations", 190], ["proverbs", 191], ["grammatically", 192], ["unfamiliar", 193], ["vowel", 194], ["Thesaurus", 195], ["ESL", 196], ["emphasis", 197], ["Vocab", 198], ["topics", 199], ["intonation", 200], ["comprehensible", 201], ["inflections", 202], ["grasp", 203], ["encyclopedic", 204], ["prosody", 205], ["flashcard", 206], ["non-verbal", 207], ["phonic", 208], ["aloud", 209], ["mnemonic", 210], ["rudimentary", 211], ["noun", 212], ["maths", 213], ["handwriting", 214], ["inflection", 215], ["narrative", 216], ["wordplay", 217], ["repertoire", 218], ["Spanish", 219], ["definition", 220], ["MLAChicagoAPAMore", 221], ["usage", 222], ["alphabets", 223], ["notation", 224], ["workbooks", 225], ["instructional", 226], ["visual", 227], ["problem-solving", 228], ["references", 229], ["instruction", 230], ["foundational", 231], ["curricula", 232], ["translated", 233], ["paragraphs", 234], ["nonverbal", 235], ["Flashcards", 236], ["tutor", 237], ["emphasizing", 238], ["interpret", 239], ["educational", 240], ["sense", 241], ["pronoun", 242], ["explanatory", 243], ["monolingual", 244], ["reading", 245], ["spellings", 246], ["teachers", 247], ["Arabic", 248], ["emphasize", 249], ["relate", 250], ["contextual", 251], ["typing", 252], ["understand", 253], ["connotation", 254], ["literal", 255], ["introduction", 256], ["speaking", 257], ["hebrew", 258], ["consonant", 259], ["similes", 260], ["memorise", 261], ["pre-reading", 262], ["keyboarding", 263], ["Hebrew", 264], ["arithmetic", 265], ["translates", 266], ["reinforce", 267], ["standardized", 268], ["figurative", 269], ["textbooks", 270], ["phonetically", 271], ["enrich", 272], ["speech", 273], ["phonemes", 274], ["meaningful", 275], ["Spelling", 276], ["imagination", 277], ["simplified", 278], ["syntactical", 279], ["subjects", 280], ["decipher", 281], ["cognitive", 282], ["homophones", 283], ["tutoring", 284], ["competence", 285], ["rote", 286], ["ambiguous", 287], ["utterances", 288], ["describing", 289], ["categorization", 290], ["crossword", 291], ["interpretation", 292], ["structured", 293], ["explanation", 294], ["cursive", 295], ["cultural", 296], ["describe", 297], ["verbiage", 298], ["terminologies", 299], ["abilities", 300], ["nuances", 301], ["non-English", 302], ["phrasebook", 303], ["didactic", 304], ["age-appropriate", 305], ["multiplication", 306], ["learned", 307], ["academic", 308], ["Esperanto", 309], ["philosophical", 310], ["teacher", 311], ["articulation", 312], ["essay", 313], ["poems", 314], ["learnt", 315], ["Idioms", 316], ["preschool", 317], ["gre", 318], ["manners", 319], ["colloquialisms", 320], ["nuance", 321], ["dialogues", 322], ["memorising", 323], ["Fluency", 324], ["expository", 325], ["scholarly", 326], ["students", 327], ["lexicons", 328], ["preschoolers", 329], ["fundamentals", 330], ["enunciation", 331], ["stylistic", 332], ["coursework", 333], ["dialogue", 334], ["ASL", 335], ["bible", 336], ["translator", 337], ["civics", 338], ["auditory", 339], ["logical", 340], ["nomenclature", 341], ["ambiguity", 342], ["interpreting", 343], ["college-level", 344], ["Quizlet", 345], ["aptitude", 346], ["mathematic", 347], ["onomatopoeia", 348], ["ontology", 349], ["encyclopedias", 350], ["persuasive", 351], ["annotated", 352], ["compositional", 353], ["practical", 354], ["essays", 355], ["conjugation", 356], ["understandings", 357], ["cloze", 358], ["education", 359], ["competency", 360], ["archaic", 361], ["familiarize", 362], ["understood", 363], ["convey", 364], ["puzzles", 365], ["classes", 366], ["preposition", 367], ["passages", 368], ["clues", 369], ["practise", 370], ["taught", 371], ["storytelling", 372], ["confusing", 373], ["alphabetic", 374], ["communicate", 375], ["succinct", 376], ["illustrate", 377], ["allusions", 378], ["familiar", 379], ["efl", 380], ["utterance", 381], ["Word", 382], ["homonyms", 383], ["printables", 384], ["biblical", 385], ["explaining", 386], ["discursive", 387], ["wordy", 388], ["multiple-choice", 389], ["collocations", 390], ["Lesson", 391], ["kinesthetic", 392], ["hiragana", 393], ["interactive", 394], ["linguistically", 395], ["ideas", 396], ["define", 397], ["Verb", 398], ["mastered", 399], ["graders", 400], ["plurals", 401], ["elaboration", 402], ["curricular", 403], ["pragmatics", 404], ["useful", 405], ["antonym", 406], ["complexity", 407], ["semantically", 408], ["English-language", 409], ["answers", 410], ["symbols", 411], ["trivia", 412], ["capitalization", 413], ["reader", 414], ["intelligible", 415], ["interpretations", 416], ["puns", 417], ["consonants", 418], ["literate", 419], ["gibberish", 420], ["riddles", 421], ["metaphorical", 422], ["logic", 423], ["beginner", 424], ["creativity", 425], ["anatomy", 426], ["class", 427], ["connotations", 428], ["rubrics", 429], ["intellect", 430], ["subtraction", 431], ["interpersonal", 432], ["pronounce", 433], ["theoretical", 434], ["imperative", 435], ["Phrase", 436], ["patois", 437], ["difficulty", 438], ["comparative", 439], ["subtleties", 440], ["practice", 441], ["paradigms", 442], ["relational", 443], ["powerpoint", 444], ["typology", 445], ["lexicography", 446], ["Worksheets", 447], ["mastering", 448], ["perception", 449], ["competencies", 450], ["linguists", 451], ["intellectual", 452], ["musicality", 453], ["prepositional", 454], ["importance", 455], ["tense", 456], ["penmanship", 457], ["grouping", 458], ["informal", 459], ["beginners", 460], ["analytical", 461], ["composing", 462], ["formal", 463], ["articulate", 464], ["Swahili", 465], ["phoneme", 466], ["higher-level", 467], ["pinyin", 468], ["imaginative", 469], ["neologisms", 470], ["cross-cultural", 471], ["derivation", 472], ["wording", 473], ["headings", 474], ["diagramming", 475], ["verse", 476], ["singular", 477], ["constructions", 478], ["motivation", 479], ["origins", 480], ["speak", 481], ["reference", 482], ["conversation", 483], ["classrooms", 484], ["aural", 485], ["strategies", 486], ["discipline", 487], ["multilingual", 488], ["distinguish", 489], ["TOEFL", 490], ["emphasizes", 491], ["Mandarin", 492], ["incomprehensible", 493], ["improvisation", 494], ["proofreading", 495], ["chord", 496], ["socialization", 497], ["referencing", 498], ["parsing", 499], ["crosswords", 500], ["supplementary", 501], ["prefixes", 502], ["elements", 503], ["gist", 504], ["relevance", 505], ["Learners", 506], ["argumentation", 507], ["katakana", 508], ["rhetoric", 509], ["lexis", 510], ["books", 511], ["incorporate", 512], ["Synonyms", 513], ["perspectives", 514], ["Phrases", 515], ["culture", 516], ["systematic", 517], ["assignments", 518], ["etymological", 519], ["Nouns", 520], ["outline", 521], ["constructs", 522], ["Merriam-Webster", 523], ["scripture", 524], ["appropriate", 525], ["studying", 526], ["communication", 527], ["habits", 528], ["summaries", 529], ["psychology", 530], ["readability", 531], ["humanities", 532], ["relevant", 533], ["reflexive", 534], ["assimilate", 535], ["theological", 536], ["adverb", 537], ["derivations", 538], ["translators", 539], ["formatting", 540], ["symbolism", 541], ["vocabularly", 542], ["metaphoric", 543], ["clue", 544], ["expression", 545], ["handbook", 546], ["communicating", 547], ["sensory", 548], ["poem", 549], ["multicultural", 550], ["grade", 551], ["usages", 552], ["written", 553], ["empathy", 554], ["ability", 555], ["conversations", 556], ["construct", 557], ["encyclopedia", 558], ["transliteration", 559], ["erudition", 560], ["common", 561], ["everyday", 562], ["narration", 563], ["sight-reading", 564], ["arabic", 565], ["formative", 566], ["term", 567], ["pertinent", 568], ["traits", 569], ["specific", 570], ["forms", 571], ["latin", 572], ["rhythmic", 573], ["Sentence", 574], ["solving", 575], ["VOCABULARY", 576], ["culturally", 577], ["quotations", 578], ["unintelligible", 579], ["science", 580], ["patterns", 581], ["proficient", 582], ["programming", 583], ["manipulatives", 584], ["non-native", 585], ["polysyllabic", 586], ["structure", 587], ["social", 588], ["expressiveness", 589], ["questions", 590], ["domain-specific", 591], ["progressions", 592], ["resources", 593], ["organizational", 594], ["letters", 595], ["fundamental", 596], ["monosyllabic", 597], ["distinctions", 598], ["broaden", 599], ["Dictionaries", 600], ["musical", 601], ["paragraph", 602], ["grade-level", 603], ["paraphrasing", 604], ["genres", 605], ["complicated", 606], ["ways", 607], ["esoteric", 608], ["tutors", 609], ["Sanskrit", 610], ["pronouncing", 611], ["preschooler", 612], ["inflected", 613], ["Latin", 614], ["repetoire", 615], ["abstraction", 616], ["pupils", 617], ["analytic", 618], ["introductions", 619], ["writings", 620], ["writting", 621], ["orthographic", 622], ["senses", 623], ["biology", 624], ["note-taking", 625], ["theory", 626], ["notions", 627], ["exegesis", 628], ["profound", 629], ["hierarchy", 630], ["similarities", 631], ["analogy", 632], ["characters", 633], ["varied", 634], ["groupings", 635], ["compose", 636], ["pre-school", 637], ["skill-building", 638], ["etiquette", 639], ["derive", 640], ["correspond", 641], ["praxis", 642], ["tutorials", 643], ["numerical", 644], ["accent", 645], ["captions", 646], ["repetitions", 647], ["pre-algebra", 648], ["in-class", 649], ["lacking", 650], ["imagery", 651], ["morphological", 652], ["explain", 653], ["intuition", 654], ["Yiddish", 655], ["possessive", 656], ["pre-k", 657], ["grades", 658], ["Kanji", 659], ["morphemes", 660], ["intelligence", 661], ["diagrams", 662], ["demonstrative", 663], ["GCSE", 664], ["calculus", 665], ["EFL", 666], ["teaches", 667], ["Spanish-English", 668], ["chapters", 669], ["Adjectives", 670], ["second-language", 671], ["write", 672], ["real-world", 673], ["intercultural", 674], ["alphabetical", 675], ["metrical", 676], ["narratives", 677], ["contextualized", 678], ["typography", 679], ["attitudes", 680], ["gestures", 681], ["normative", 682], ["webquest", 683], ["deductive", 684], ["summarize", 685], ["handouts", 686], ["developmental", 687], ["story-telling", 688], ["pedagogic", 689], ["JLPT", 690], ["rudiments", 691], ["essential", 692], ["Spanish-speaking", 693], ["Tagalog", 694], ["prosodic", 695], ["poetics", 696], ["description", 697], ["lyrical", 698], ["dolch", 699], ["aspects", 700], ["perspective", 701], ["readers", 702], ["nonfiction", 703], ["principles", 704], ["Fluent", 705], ["methodology", 706], ["concordance", 707], ["WordNet", 708], ["recitation", 709], ["straightforward", 710], ["cultures", 711], ["mannerisms", 712], ["develop", 713], ["technical", 714], ["philosophy", 715], ["focus", 716], ["curriculums", 717], ["topic", 718], ["morphology", 719], ["self-awareness", 720], ["insight", 721], ["sadlier", 722], ["elocution", 723], ["dyslexia", 724], ["notations", 725], ["Verbal", 726], ["abstract", 727], ["structuring", 728], ["third-grade", 729], ["history", 730], ["meaningless", 731], ["simple", 732], ["instructive", 733], ["plural", 734], ["Translate", 735], ["intermediate", 736], ["scholastic", 737], ["content", 738], ["cognition", 739], ["argot", 740], ["naming", 741], ["syllabi", 742], ["spatial", 743], ["cognates", 744], ["parlance", 745], ["difficult", 746], ["Wiktionary", 747], ["vulgar", 748], ["Etymology", 749], ["listening", 750], ["easy-to-understand", 751], ["toefl", 752], ["techniques", 753], ["repetitive", 754], ["names", 755], ["tagalog", 756], ["perceptual", 757], ["theories", 758], ["rhythm", 759], ["visually", 760], ["particular", 761], ["diversity", 762], ["proficiencies", 763], ["prompts", 764], ["proper", 765], ["incorporating", 766], ["nonsensical", 767], ["sociological", 768], ["analyze", 769], ["coherent", 770], ["defining", 771], ["themes", 772], ["declarative", 773], ["handout", 774], ["rigor", 775], ["sociology", 776], ["two-word", 777], ["spell", 778], ["subset", 779], ["homeschool", 780], ["significance", 781], ["brainstorming", 782], ["scientific", 783], ["richness", 784], ["readings", 785], ["combining", 786], ["differences", 787], ["verses", 788], ["appreciation", 789], ["emotion", 790], ["pragmatic", 791], ["Phonics", 792], ["compendium", 793], ["simplify", 794], ["dictation", 795], ["geometry", 796], ["Rhyming", 797], ["interpretive", 798], ["educators", 799], ["catechism", 800], ["Terminology", 801], ["schooling", 802], ["beginning", 803], ["templates", 804], ["multisyllabic", 805], ["readable", 806], ["cadences", 807], ["algebraic", 808], ["superlatives", 809], ["repeating", 810], ["typed", 811], ["demonstrate", 812], ["derived", 813], ["sensibility", 814], ["snippets", 815], ["babble", 816], ["Farsi", 817], ["encompass", 818], ["substantive", 819], ["Grammatical", 820], ["abstractions", 821], ["classical", 822], ["quizes", 823], ["distinguishing", 824], ["Bible", 825], ["multimedia", 826], ["evolved", 827], ["confuse", 828], ["bibliographies", 829], ["Learning", 830], ["attributes", 831], ["chronological", 832], ["experiential", 833], ["reflect", 834], ["Thesaurus.Change", 835], ["engaging", 836], ["vague", 837], ["level", 838], ["ontologies", 839], ["notion", 840], ["simpler", 841], ["bibliographic", 842], ["idiosyncratic", 843], ["arcane", 844], ["easier", 845], ["usefulness", 846], ["differentiated", 847], ["clarify", 848], ["GRE", 849], ["computational", 850], ["summarizing", 851], ["tasks", 852], ["portuguese", 853], ["insights", 854], ["haiku", 855], ["correct", 856], ["associative", 857], ["thinking", 858], ["assessment", 859], ["adapt", 860], ["stylistics", 861], ["sayings", 862], ["interactivity", 863], ["liturgy", 864], ["illustrations", 865], ["readiness", 866], ["similarity", 867], ["integrating", 868], ["checklists", 869], ["meant", 870], ["liturgical", 871], ["bibliography", 872], ["broader", 873], ["wordlist", 874], ["consciousness", 875], ["explicit", 876], ["formulae", 877], ["character", 878], ["improve", 879], ["cross-curricular", 880], ["humor", 881], ["distinct", 882], ["lists", 883], ["concept", 884], ["subject-specific", 885], ["informational", 886], ["buzzwords", 887], ["intuitively", 888], ["clearer", 889], ["enriching", 890], ["taxonomic", 891], ["inferences", 892], ["comprehensions", 893], ["assimilated", 894], ["revising", 895], ["brevity", 896], ["derives", 897], ["Hiragana", 898], ["introduce", 899], ["FlashCards", 900], ["pre-schoolers", 901], ["Sentences", 902], ["lectures", 903], ["Words", 904], ["reinforces", 905], ["intonations", 906], ["recognition", 907], ["thesauri", 908], ["mistakes", 909], ["study", 910], ["keyword", 911], ["traditions", 912], ["deciphering", 913], ["assignment", 914], ["refer", 915], ["languge", 916], ["authoritative", 917], ["referring", 918], ["jumbled", 919], ["jokes", 920], ["awareness", 921], ["quantitative", 922], ["student", 923], ["categorize", 924], ["Afrikaans", 925], ["integrate", 926], ["difficulties", 927], ["concisely", 928], ["English-speaking", 929], ["geographical", 930], ["identify", 931], ["cryptic", 932], ["rules", 933], ["styles", 934], ["differentiate", 935], ["problematic", 936], ["scrabble", 937], ["formulas", 938], ["trigonometry", 939], ["grouped", 940], ["politeness", 941], ["merely", 942], ["knowlege", 943], ["hypertext", 944], ["characteristics", 945], ["keywords", 946], ["intuitive", 947], ["annotations", 948], ["interpreted", 949], ["audience", 950], ["presentations", 951], ["defined", 952], ["brainstorm", 953], ["hone", 954], ["gcse", 955], ["emphasized", 956], ["declensions", 957], ["revise", 958], ["formality", 959], ["borrowed", 960], ["horizons", 961], ["coding", 962], ["peculiarities", 963], ["cliches", 964], ["asl", 965], ["words/phrases", 966], ["evolving", 967], ["mental", 968], ["Math", 969], ["worldview", 970], ["schoolers", 971], ["presentation", 972], ["mapping", 973], ["theology", 974], ["facts", 975], ["course", 976], ["internalize", 977], ["creative", 978], ["checklist", 979], ["improvise", 980], ["focuses", 981], ["sociolinguistics", 982], ["EUdictEUdict", 983], ["parse", 984], ["remembering", 985], ["annotation", 986], ["improvising", 987], ["intelligences", 988], ["behaviors", 989], ["terminological", 990], ["intricacies", 991], ["identity", 992], ["genre", 993], ["affective", 994], ["in-depth", 995], ["Learn", 996], ["tongue", 997], ["french", 998], ["conceptions", 999], ["denotation", 1000], ["rhythmical", 1001], ["subjective", 1002], ["anthropology", 1003], ["suffix", 1004], ["bilingualism", 1005], ["systematically", 1006], ["conceptually", 1007], ["test-taking", 1008], ["rhythms", 1009], ["persuasion", 1010], ["subject", 1011], ["valuable", 1012], ["graphs", 1013], ["coloring", 1014], ["sanskrit", 1015], ["deepen", 1016], ["book", 1017], ["mind", 1018], ["self-confidence", 1019], ["subtlety", 1020], ["reading/writing", 1021], ["vocabs", 1022], ["thesauruses", 1023], ["puzzle", 1024], ["alliterative", 1025], ["cues", 1026], ["recite", 1027], ["computer-based", 1028], ["disciplines", 1029], ["simile", 1030], ["typographic", 1031], ["inference", 1032], ["physiology", 1033], ["writers", 1034], ["inferencing", 1035], ["generalization", 1036], ["CloseThesaurusThe", 1037], ["Slang", 1038], ["dexterity", 1039], ["storybooks", 1040], ["step-by-step", 1041], ["scriptures", 1042], ["rather", 1043], ["decimals", 1044], ["commonplace", 1045], ["qualitative", 1046], ["intransitive", 1047], ["polyglot", 1048], ["slangs", 1049], ["aesthetics", 1050], ["methodological", 1051], ["delve", 1052], ["Portuguese", 1053], ["gender", 1054], ["smarts", 1055], ["kindergarden", 1056], ["outlines", 1057], ["simplistic", 1058], ["critical", 1059], ["complexities", 1060], ["melody", 1061], ["cram", 1062], ["suggestions", 1063], ["Aramaic", 1064], ["vocabulaire", 1065], ["composition", 1066], ["attention", 1067], ["symbolic", 1068], ["aphasia", 1069], ["prescriptive", 1070], ["conventions", 1071], ["scriptural", 1072], ["Antonyms", 1073], ["Languages", 1074], ["fingerspelling", 1075], ["jumble", 1076], ["receptive", 1077], ["webquests", 1078], ["transitive", 1079], ["e.g.", 1080], ["library", 1081], ["metadata", 1082], ["studies", 1083], ["superfluous", 1084], ["document", 1085], ["lacks", 1086], ["IELTS", 1087], ["lack", 1088], ["example", 1089], ["clarity", 1090], ["sequencing", 1091], ["linguist", 1092], ["elaborated", 1093], ["personality", 1094], ["nuanced", 1095], ["broad", 1096], ["obscure", 1097], ["argumentative", 1098], ["Taxonomy", 1099], ["irrelevant", 1100], ["introducing", 1101], ["Cantonese", 1102], ["methodologies", 1103], ["searchable", 1104], ["markup", 1105], ["comma", 1106], ["defines", 1107], ["ielts", 1108], ["beliefs", 1109], ["essentials", 1110], ["databases", 1111], ["analyzing", 1112], ["definite", 1113], ["routines", 1114], ["predicates", 1115], ["shapes", 1116], ["iq", 1117], ["important", 1118], ["object-oriented", 1119], ["formulate", 1120], ["predicate", 1121], ["rewrite", 1122], ["profanity", 1123], ["distinction", 1124], ["clearly", 1125], ["Spoken", 1126], ["knack", 1127], ["constructing", 1128], ["structures", 1129], ["different", 1130], ["mini-lessons", 1131], ["logically", 1132], ["excel", 1133], ["patience", 1134], ["infinitive", 1135], ["differs", 1136], ["classmates", 1137], ["correlate", 1138], ["Prepositions", 1139], ["beyond", 1140], ["identifying", 1141], ["pejorative", 1142], ["know-how", 1143], ["immersion", 1144], ["printable", 1145], ["Teach", 1146], ["mindset", 1147], ["dialog", 1148], ["Meaning", 1149], ["indispensable", 1150], ["exposition", 1151], ["courses", 1152], ["grader", 1153], ["implicit", 1154], ["emotions", 1155], ["rewriting", 1156], ["Hindi", 1157], ["toddlers", 1158], ["made-up", 1159], ["nonsense", 1160], ["interpretative", 1161], ["permutations", 1162], ["ELLs", 1163], ["pidgin", 1164], ["curiosity", 1165], ["school", 1166], ["memorised", 1167], ["annotating", 1168], ["Testament", 1169], ["monologue", 1170], ["augment", 1171], ["Noun", 1172], ["emergent", 1173], ["humorous", 1174], ["Kiswahili", 1175], ["erudite", 1176], ["editing", 1177], ["graphing", 1178], ["unambiguous", 1179], ["psychological", 1180], ["criticism", 1181], ["correspondences", 1182], ["Linguistic", 1183], ["typos", 1184], ["aids", 1185], ["Flashcard", 1186], ["Pinyin", 1187], ["spelled", 1188], ["punctuations", 1189], ["broadly", 1190], ["stressing", 1191], ["lecture", 1192], ["visualize", 1193], ["geographic", 1194], ["memorisation", 1195], ["denote", 1196], ["repertoires", 1197], ["Synonym", 1198], ["breadth", 1199], ["invaluable", 1200], ["possibilities", 1201], ["dyslexic", 1202], ["enrichment", 1203], ["training", 1204], ["paraphrase", 1205], ["dictionary.com", 1206], ["etymologies", 1207], ["self-esteem", 1208], ["eloquence", 1209], ["thorough", 1210], ["semiotics", 1211], ["moral", 1212], ["resource", 1213], ["query", 1214], ["Memorize", 1215], ["expressing", 1216], ["tools", 1217], ["combinations", 1218], ["Katakana", 1219], ["habit", 1220], ["situational", 1221], ["self-expression", 1222], ["easy-to-follow", 1223], ["braille", 1224], ["inferential", 1225], ["Writing", 1226], ["illustrative", 1227], ["expanded", 1228], ["affixes", 1229], ["poetical", 1230], ["Colloquial", 1231], ["physical", 1232], ["prerequisite", 1233], ["proofread", 1234], ["fractions", 1235], ["sequences", 1236], ["purely", 1237], ["adapting", 1238], ["enhance", 1239], ["expand", 1240], ["corpora", 1241], ["intended", 1242], ["contemporary", 1243], ["norms", 1244], ["morals", 1245], ["devoid", 1246], ["frequently", 1247], ["descriptors", 1248], ["non-technical", 1249], ["creating", 1250], ["surnames", 1251], ["factual", 1252], ["verbalize", 1253], ["anecdotes", 1254], ["diverse", 1255], ["ELL", 1256], ["subtitles", 1257], ["loanwords", 1258], ["importantly", 1259], ["evolve", 1260], ["discourses", 1261], ["discussions", 1262], ["learns", 1263], ["analogical", 1264], ["emotional", 1265], ["paragraphing", 1266], ["taks", 1267], ["classifications", 1268], ["gaelic", 1269], ["Lexical", 1270], ["brain", 1271], ["literatures", 1272], ["minds", 1273], ["transcribe", 1274], ["gmat", 1275], ["observation", 1276], ["acceptable", 1277], ["motivating", 1278], ["intelligibility", 1279], ["gleaned", 1280], ["websters", 1281], ["framework", 1282], ["conveys", 1283], ["lisp", 1284], ["documentation", 1285], ["Scripture", 1286], ["motivate", 1287], ["interjections", 1288], ["dissertation", 1289], ["differently", 1290], ["uses", 1291], ["element", 1292], ["read-aloud", 1293], ["approach", 1294], ["anthropological", 1295], ["histories", 1296], ["generalizations", 1297], ["paradigm", 1298], ["perceptions", 1299], ["hierarchical", 1300], ["ebonics", 1301], ["lowercase", 1302], ["LANGUAGE", 1303], ["scripting", 1304], ["metaphysics", 1305], ["semiotic", 1306], ["clauses", 1307], ["differing", 1308], ["italicized", 1309], ["fingerings", 1310], ["OED", 1311], ["strengths", 1312], ["non-fiction", 1313], ["Homework", 1314], ["masculine", 1315], ["denoting", 1316], ["correctly", 1317], ["foreign", 1318], ["visualization", 1319], ["anagram", 1320], ["interpreters", 1321], ["Dolch", 1322], ["cross-referencing", 1323], ["anatomical", 1324], ["exam", 1325], ["gestural", 1326], ["summary", 1327], ["historical", 1328], ["mythology", 1329], ["illustrating", 1330], ["objectives", 1331], ["PowerPoint", 1332], ["pictionary", 1333], ["critique", 1334], ["vocabulario", 1335], ["originality", 1336], ["vocalization", 1337], ["Learner", 1338], ["kindergarteners", 1339], ["wisdom", 1340], ["trait", 1341], ["cantonese", 1342], ["functional", 1343], ["developmentally", 1344], ["comprehensibility", 1345], ["persistence", 1346], ["content-area", 1347], ["biographical", 1348], ["referential", 1349], ["generalize", 1350], ["task", 1351], ["incorporates", 1352], ["vocabular", 1353], ["sequence", 1354], ["wordsearch", 1355], ["Algebra", 1356], ["synthesize", 1357], ["necessarily", 1358], ["stereotyped", 1359], ["discern", 1360], ["charades", 1361], ["innate", 1362], ["uncommon", 1363], ["qualities", 1364], ["SAT", 1365], ["dictate", 1366], ["interpreter", 1367], ["objects", 1368], ["historiography", 1369], ["format", 1370], ["relationships", 1371], ["activites", 1372], ["multi-syllable", 1373], ["footnotes", 1374], ["exercise", 1375], ["evaluative", 1376], ["Literacy", 1377], ["arts", 1378], ["listener", 1379], ["exploration", 1380], ["humour", 1381], ["broadened", 1382], ["infer", 1383], ["immensely", 1384], ["wide-ranging", 1385], ["figuring", 1386], ["conversant", 1387], ["ethnicity", 1388], ["supplemented", 1389], ["focusing", 1390], ["ethic", 1391], ["longman", 1392], ["sufficiently", 1393], ["assessments", 1394], ["fill-in-the-blank", 1395], ["perceive", 1396], ["bulleted", 1397], ["characteristic", 1398], ["certain", 1399], ["nonstandard", 1400], ["suffice", 1401], ["overview", 1402], ["cognate", 1403], ["varying", 1404], ["referents", 1405], ["classification", 1406], ["general", 1407], ["variations", 1408], ["schemata", 1409], ["tagging", 1410], ["unconsciously", 1411], ["monologues", 1412], ["classify", 1413], ["sort", 1414], ["richer", 1415], ["approaches", 1416], ["progressively", 1417], ["cadence", 1418], ["cultivate", 1419], ["scripts", 1420], ["refers", 1421], ["Urdu", 1422], ["intermediate-level", 1423], ["tropes", 1424], ["creole", 1425], ["vastly", 1426], ["idiosyncrasies", 1427], ["augmented", 1428], ["sophisticated", 1429], ["materials", 1430], ["backgrounds", 1431], ["tedious", 1432], ["tonal", 1433], ["kids", 1434], ["intensive", 1435], ["commentaries", 1436], ["recognizable", 1437], ["Maths", 1438], ["Kindergarten", 1439], ["italics", 1440], ["peculiar", 1441], ["demonstrates", 1442], ["wikipedia", 1443], ["esol", 1444], ["adjectival", 1445], ["helpful", 1446], ["clever", 1447], ["simplest", 1448], ["corpus", 1449], ["superlative", 1450], ["text-based", 1451], ["Phonetics", 1452], ["use", 1453], ["Alphabet", 1454], ["representations", 1455], ["behavioral", 1456], ["Translation", 1457], ["enriched", 1458], ["postmodern", 1459], ["behavior", 1460], ["advanced", 1461], ["sexuality", 1462], ["pictorial", 1463], ["proverb", 1464], ["knowing", 1465], ["unscramble", 1466], ["Quizzes", 1467], ["empirical", 1468], ["versed", 1469], ["equivalents", 1470], ["subject-matter", 1471], ["experimentation", 1472], ["methods", 1473], ["countable", 1474], ["subjunctive", 1475], ["reliability/comparability", 1476], ["assertiveness", 1477], ["esp", 1478], ["capabilities", 1479], ["reproducible", 1480], ["aspect", 1481], ["Proficiency", 1482], ["corresponding", 1483], ["conversationally", 1484], ["French", 1485], ["incorrect", 1486], ["authoring", 1487], ["crucial", 1488], ["assumptions", 1489], ["taxonomies", 1490], ["music", 1491], ["encompassing", 1492], ["one-word", 1493], ["challenging", 1494], ["research-based", 1495], ["questionnaire", 1496], ["subconscious", 1497], ["folktales", 1498], ["deeper", 1499], ["syntactically", 1500], ["rationale", 1501], ["confusion", 1502], ["k-12", 1503], ["often", 1504], ["recognize", 1505], ["developing", 1506], ["declension", 1507], ["layman", 1508], ["activities", 1509], ["tricky", 1510], ["accompanying", 1511], ["comprehensive", 1512], ["speakers", 1513], ["manuals", 1514], ["inappropriate", 1515], ["ESL/EFL", 1516], ["exams", 1517], ["preparation", 1518], ["exemplars", 1519], ["tendency", 1520], ["formalized", 1521], ["deriving", 1522], ["syllabic", 1523], ["Dialects", 1524], ["oneself", 1525], ["indicative", 1526], ["rhymed", 1527], ["English-Spanish", 1528], ["trivial", 1529], ["Bahasa", 1530], ["create", 1531], ["correctness", 1532], ["interesting", 1533], ["wikis", 1534], ["propositional", 1535], ["improving", 1536], ["parenthetical", 1537], ["underlying", 1538], ["elicit", 1539], ["language-learning", 1540], ["parser", 1541], ["associating", 1542], ["influences", 1543], ["ungrammatical", 1544], ["standardised", 1545], ["sensibilities", 1546], ["drawing", 1547], ["aesthetic", 1548], ["entries", 1549], ["commonly-used", 1550], ["peers", 1551], ["summarization", 1552], ["discussion", 1553], ["Phonetic", 1554], ["answer", 1555], ["sadlier-oxford", 1556], ["amusing", 1557], ["explorations", 1558], ["franca", 1559], ["variationsEarly", 1560], ["remedial", 1561], ["purposeful", 1562], ["biographies", 1563], ["classifying", 1564], ["genders", 1565], ["synopsis", 1566], ["specialized", 1567], ["experiences", 1568], ["rational", 1569], ["precise", 1570], ["colouring", 1571], ["necessary", 1572], ["mini-lesson", 1573], ["describes", 1574], ["clichés", 1575], ["imperfect", 1576], ["academics", 1577], ["commas", 1578], ["musicianship", 1579], ["usefully", 1580], ["standards", 1581], ["middle", 1582], ["intelligent", 1583], ["sarcasm", 1584], ["sharpen", 1585], ["verbatim", 1586], ["well-developed", 1587], ["enormously", 1588], ["generative", 1589], ["illiterate", 1590], ["interrelated", 1591], ["middle-school", 1592], ["style", 1593], ["chemistry", 1594], ["tests", 1595], ["transcriptions", 1596], ["lingua", 1597], ["complex", 1598], ["graphical", 1599], ["exhaustive", 1600], ["fifth-grade", 1601], ["ethics", 1602], ["objective", 1603], ["numeric", 1604], ["acrostic", 1605], ["sections", 1606], ["genius", 1607], ["cleverness", 1608], ["novice", 1609], ["situations", 1610], ["extraneous", 1611], ["sometimes", 1612], ["artistic", 1613], ["participle", 1614], ["well-chosen", 1615], ["acumen", 1616], ["heritage", 1617], ["rigorous", 1618], ["chinese", 1619], ["learing", 1620], ["tonality", 1621], ["grade-appropriate", 1622], ["language-based", 1623], ["motivational", 1624], ["adding", 1625], ["Quiz", 1626], ["subtext", 1627], ["four-letter", 1628], ["self-assessment", 1629], ["refinement", 1630], ["schema", 1631], ["Britannica", 1632], ["ancestry", 1633], ["familiarizing", 1634], ["analyse", 1635], ["instructors", 1636], ["fourth-grade", 1637], ["homeschooling", 1638], ["exegetical", 1639], ["own", 1640], ["interchangeably", 1641], ["interjection", 1642], ["open-ended", 1643], ["voice", 1644], ["question", 1645], ["songs", 1646], ["handbooks", 1647], ["wordsstarts-withends-withcontainsSearch", 1648], ["Pronouns", 1649], ["relates", 1650], ["differ", 1651], ["chronology", 1652], ["classwork", 1653], ["grade-school", 1654], ["pertaining", 1655], ["conversing", 1656], ["Glossary", 1657], ["content-based", 1658], ["template", 1659], ["influenced", 1660], ["learnersn/aScale", 1661], ["imaginations", 1662], ["preface", 1663], ["homophone", 1664], ["conjunctions", 1665], ["well-written", 1666], ["connotative", 1667], ["upper-intermediate", 1668], ["fiction", 1669], ["counting", 1670], ["teamwork", 1671], ["spreadsheet", 1672], ["underlined", 1673], ["scholars", 1674], ["specifics", 1675], ["chords", 1676], ["reciting", 1677], ["peoples", 1678], ["insightful", 1679], ["highlighting", 1680], ["evolves", 1681], ["Curriculum", 1682], ["boundaries", 1683], ["misspelled", 1684], ["entails", 1685], ["children", 1686], ["authors", 1687], ["Biblical", 1688], ["emotive", 1689], ["preceding", 1690], ["derogatory", 1691], ["stereotypes", 1692], ["entertaining", 1693], ["wordiness", 1694], ["reflection", 1695], ["citizenship", 1696], ["stanzas", 1697], ["denominator", 1698], ["calligraphy", 1699], ["romaji", 1700], ["terse", 1701], ["fcat", 1702], ["testament", 1703], ["excercises", 1704], ["interrogative", 1705], ["coursebook", 1706], ["informative", 1707], ["folklore", 1708], ["eloquent", 1709], ["non-standard", 1710], ["german", 1711], ["racial", 1712], ["gradually", 1713], ["acronym", 1714], ["physicstermpapers.com", 1715], ["manner", 1716], ["Conversational", 1717], ["morality", 1718], ["representational", 1719], ["algorithmic", 1720], ["culinary", 1721], ["practices", 1722], ["sociolinguistic", 1723], ["toeic", 1724], ["philology", 1725], ["Translating", 1726], ["understands", 1727], ["hyperbole", 1728], ["ease", 1729], ["elaborate", 1730], ["accents", 1731], ["obvious", 1732], ["statistical", 1733], ["activity", 1734], ["relation", 1735], ["schoolwork", 1736], ["nicknames", 1737], ["gerund", 1738], ["inventiveness", 1739], ["conciseness", 1740], ["chess", 1741], ["gendered", 1742], ["answering", 1743], ["gifted", 1744], ["semester", 1745], ["spellchecker", 1746], ["dialogs", 1747], ["origin", 1748], ["résumé", 1749], ["speaks", 1750], ["presentational", 1751], ["guidelines", 1752], ["acquainted", 1753], ["fluidity", 1754], ["multi-sensory", 1755], ["euphemisms", 1756], ["meaningfully", 1757], ["botany", 1758], ["annotate", 1759], ["concentrating", 1760], ["overused", 1761], ["recitations", 1762], ["retrieval", 1763], ["easy-to-read", 1764], ["modern", 1765], ["interaction", 1766], ["cramming", 1767], ["esteem", 1768], ["replete", 1769], ["e-learning", 1770], ["accurately", 1771], ["how", 1772], ["mandarin", 1773], ["identities", 1774], ["shakespeare", 1775], ["demonstrating", 1776], ["proficiently", 1777], ["Reading", 1778], ["mannerism", 1779], ["trite", 1780], ["XML", 1781], ["identification", 1782], ["abstruse", 1783], ["ingrained", 1784], ["pre-intermediate", 1785], ["hence", 1786], ["tool", 1787], ["form", 1788], ["moods", 1789], ["clarifying", 1790], ["contain", 1791], ["perceptive", 1792], ["invent", 1793], ["equations", 1794], ["accustomed", 1795], ["hyphenated", 1796], ["vocal", 1797], ["audiences", 1798], ["phrased", 1799], ["tremendously", 1800], ["inclusion", 1801], ["delving", 1802], ["visuals", 1803], ["Amharic", 1804], ["instill", 1805], ["behaviours", 1806], ["catchy", 1807], ["Koine", 1808], ["powerpoints", 1809], ["prep", 1810], ["phrasings", 1811], ["talking", 1812], ["personification", 1813], ["malay", 1814], ["repetitious", 1815], ["implication", 1816], ["spirituality", 1817], ["intellectually", 1818], ["parenting", 1819], ["questioning", 1820], ["dimension", 1821], ["analogous", 1822], ["blackboard", 1823], ["consciously", 1824], ["creatively", 1825], ["IQ", 1826], ["concentrate", 1827], ["TOEIC", 1828], ["influence", 1829], ["universal", 1830], ["borrowing", 1831], ["his/her", 1832], ["whatever", 1833], ["keyboard", 1834], ["improvisational", 1835], ["read", 1836], ["studyHigh-frequency", 1837], ["usable", 1838], ["quizzing", 1839], ["assonance", 1840], ["Catalan", 1841], ["attitude", 1842], ["suggestive", 1843], ["talents", 1844], ["qualifications", 1845], ["ambiguities", 1846], ["bahasa", 1847], ["inspire", 1848], ["K-12", 1849], ["uniqueness", 1850], ["useless", 1851], ["individualized", 1852], ["sketching", 1853], ["ethnographic", 1854], ["scores", 1855], ["messaging", 1856], ["Linguistics", 1857], ["allusion", 1858], ["appendices", 1859], ["scope", 1860], ["adequately", 1861], ["assessing", 1862], ["deaf", 1863], ["sounds", 1864], ["ged", 1865], ["stimuli", 1866], ["secondary", 1867], ["melodies", 1868], ["transcends", 1869], ["decoding", 1870], ["variables", 1871], ["equivalent", 1872], ["tends", 1873], ["copywriting", 1874], ["hymns", 1875], ["Geography", 1876], ["progresses", 1877], ["glean", 1878], ["necessity", 1879], ["multi-media", 1880], ["educate", 1881], ["revision", 1882], ["programing", 1883], ["stilted", 1884], ["tutorial", 1885], ["outlining", 1886], ["inspiration", 1887], ["silly", 1888], ["human", 1889], ["archetypes", 1890], ["relating", 1891], ["pedantic", 1892], ["greatly", 1893], ["indexing", 1894], ["well-structured", 1895], ["commentary", 1896], ["audio-visual", 1897], ["instructor", 1898], ["oxford", 1899], ["relearn", 1900], ["adaptability", 1901], ["impress", 1902], ["salient", 1903], ["voices", 1904], ["doctrinal", 1905], ["banal", 1906], ["equate", 1907], ["reflects", 1908], ["harmonic", 1909], ["anagrams", 1910], ["inventive", 1911], ["literally", 1912], ["hyperlinked", 1913], ["explore", 1914], ["evocative", 1915], ["contrastive", 1916], ["sensorial", 1917], ["Gaelic", 1918], ["Greek", 1919], ["parables", 1920], ["statements", 1921], ["i.e.", 1922], ["redundant", 1923], ["obsolete", 1924], ["speeches", 1925], ["attribute", 1926], ["questionnaires", 1927], ["ordinal", 1928], ["thematically", 1929], ["HTML", 1930], ["greek", 1931], ["manuscript", 1932], ["technological", 1933], ["geometric", 1934], ["technique", 1935], ["sophistication", 1936], ["ordinary", 1937], ["Germanic", 1938], ["converse", 1939], ["spiritual", 1940], ["menus", 1941], ["verbage", 1942], ["categories", 1943], ["conjugating", 1944], ["conceptualization", 1945], ["specialization", 1946], ["Pimsleur", 1947], ["acquaintance", 1948], ["choreographic", 1949], ["resume", 1950], ["assimilating", 1951], ["vital", 1952], ["refresher", 1953], ["database", 1954], ["simplicity", 1955], ["personal", 1956], ["smartboard", 1957], ["profoundly", 1958], ["self-discipline", 1959], ["indecipherable", 1960], ["cataloging", 1961], ["relations", 1962], ["witty", 1963], ["elaborating", 1964], ["irony", 1965], ["stimulating", 1966], ["performative", 1967], ["preterite", 1968], ["blogging", 1969], ["sorts", 1970], ["expertise", 1971], ["fascination", 1972], ["childhood", 1973], ["GMAT", 1974], ["quotation", 1975], ["scales", 1976], ["given", 1977], ["mundane", 1978], ["spreadsheets", 1979], ["charts", 1980], ["extent", 1981], ["GRAMMAR", 1982], ["responses", 1983], ["koine", 1984], ["truths", 1985], ["implications", 1986], ["generalizing", 1987], ["conscious", 1988], ["ideology", 1989], ["poets", 1990], ["enriches", 1991], ["implies", 1992], ["swahili", 1993], ["explores", 1994], ["explicitly", 1995], ["handwritten", 1996], ["yiddish", 1997], ["evolution", 1998], ["insults", 1999], ["Phrasal", 2000], ["considerably", 2001], ["jargons", 2002], ["effectively", 2003], ["philosophies", 2004], ["aphorisms", 2005], ["rewritten", 2006], ["globalization", 2007], ["numbering", 2008], ["kana", 2009], ["transcend", 2010], ["means", 2011], ["urdu", 2012], ["Chinese", 2013], ["ks3", 2014], ["hyphenation", 2015], ["distinctly", 2016], ["careful", 2017], ["ingenuity", 2018], ["purpose", 2019], ["especially", 2020], ["developed", 2021], ["assimilation", 2022], ["differentiating", 2023], ["epistemology", 2024], ["minutiae", 2025], ["end-of-chapter", 2026], ["misunderstood", 2027], ["test", 2028], ["primitive", 2029], ["encourage", 2030], ["weaknesses", 2031], ["standardization", 2032], ["sciences", 2033], ["cohesive", 2034], ["role-play", 2035], ["literacies", 2036], ["Ability", 2037], ["signification", 2038], ["perceived", 2039], ["complement", 2040], ["appealing", 2041], ["levels", 2042], ["analysis", 2043], ["perhaps", 2044], ["modality", 2045], ["penchant", 2046], ["cataloguing", 2047], ["Phonology", 2048], ["introduces", 2049], ["Listening", 2050], ["emphasise", 2051], ["copious", 2052], ["audio", 2053], ["RDF", 2054], ["checker", 2055], ["querying", 2056], ["appendix", 2057], ["indigenous", 2058], ["capitals", 2059], ["commands", 2060], ["roots", 2061], ["polite", 2062], ["realism", 2063], ["overly", 2064], ["layout", 2065], ["genetics", 2066], ["nationalities", 2067], ["factoids", 2068], ["readily", 2069], ["documents", 2070], ["enough", 2071], ["thesis", 2072], ["treatises", 2073], ["corresponds", 2074], ["typological", 2075], ["contains", 2076], ["formatted", 2077], ["encouragement", 2078], ["develops", 2079], ["analysing", 2080], ["cohesion", 2081], ["sentance", 2082], ["standpoint", 2083], ["hands-on", 2084], ["read-alouds", 2085], ["melodic", 2086], ["euphemism", 2087], ["extracurricular", 2088], ["accentuation", 2089], ["hierarchies", 2090], ["hand-eye", 2091], ["iconography", 2092], ["hyperlinks", 2093], ["frameworks", 2094], ["changing", 2095], ["pre-test", 2096], ["drawings", 2097], ["convoluted", 2098], ["humanistic", 2099], ["moreover", 2100], ["dialectical", 2101], ["usability", 2102], ["extensive", 2103], ["schemas", 2104], ["interests", 2105], ["dictonary", 2106], ["expletives", 2107], ["multisensory", 2108], ["flexibility", 2109], ["savvy", 2110], ["toolkit", 2111], ["LingvoSoft", 2112], ["verbalization", 2113], ["inflectional", 2114], ["altogether", 2115], ["genealogy", 2116], ["akin", 2117], ["span", 2118], ["declamation", 2119], ["overt", 2120], ["pretest", 2121], ["actual", 2122], ["evident", 2123], ["well-defined", 2124], ["emphases", 2125], ["dealing", 2126], ["brains", 2127], ["dialectic", 2128], ["sufficient", 2129], ["ethnic", 2130], ["high-level", 2131], ["nationality", 2132], ["dual-language", 2133], ["feelings", 2134], ["navigate", 2135], ["preparatory", 2136], ["publishing", 2137], ["manipulate", 2138], ["refine", 2139], ["visualizing", 2140], ["integrates", 2141], ["individuality", 2142], ["high-school", 2143], ["non-linguistic", 2144], ["manageable", 2145], ["encompasses", 2146], ["cliche", 2147], ["predefined", 2148], ["verbose", 2149], ["mifflin", 2150], ["hanzi", 2151], ["somewhat", 2152], ["mood", 2153], ["poorly", 2154], ["builds", 2155], ["rearranging", 2156], ["academically", 2157], ["japanese", 2158], ["non-Western", 2159], ["radically", 2160], ["pretentious", 2161], ["inadequate", 2162], ["Teaching", 2163], ["development", 2164], ["gramar", 2165], ["modifying", 2166], ["Worksheet", 2167], ["antecedents", 2168], ["organize", 2169], ["citations", 2170], ["dialectal", 2171], ["facilitate", 2172], ["pertain", 2173], ["interactively", 2174], ["capability", 2175], ["thoroughly", 2176], ["appropriately", 2177], ["single-word", 2178], ["Dictionary.com", 2179], ["multi-lingual", 2180], ["Idiom", 2181], ["intricate", 2182], ["unrelated", 2183], ["temperament", 2184], ["endings", 2185], ["Chinese-English", 2186], ["parsed", 2187], ["cursory", 2188], ["KS3", 2189], ["jot", 2190], ["consistent", 2191], ["lore", 2192], ["accessible", 2193], ["macros", 2194], ["complements", 2195], ["contents", 2196], ["undergraduate", 2197], ["glosses", 2198], ["distinctive", 2199], ["maturity", 2200], ["subjectivity", 2201], ["guessing", 2202], ["involves", 2203], ["behavioural", 2204], ["bi-lingual", 2205], ["text-to-speech", 2206], ["correcting", 2207], ["religion", 2208], ["nurture", 2209], ["Ebonics", 2210], ["distinguishes", 2211], ["multi-syllabic", 2212], ["reinforcement", 2213], ["object", 2214], ["reader-friendly", 2215], ["cliché", 2216], ["aims", 2217], ["constitutes", 2218], ["tone", 2219], ["pentatonic", 2220], ["legalese", 2221], ["articles", 2222], ["seldom", 2223], ["automaticity", 2224], ["misspellings", 2225], ["choices", 2226], ["correlates", 2227], ["formulaic", 2228], ["research", 2229], ["categorizing", 2230], ["material", 2231], ["Latinate", 2232], ["anecdote", 2233], ["consistency", 2234], ["timbre", 2235], ["enthusiasm", 2236], ["adaptable", 2237], ["rich", 2238], ["spaces", 2239], ["intro", 2240], ["justification", 2241], ["messages", 2242], ["sound", 2243], ["awkward", 2244], ["allegory", 2245], ["hermeneutics", 2246], ["unstructured", 2247], ["collective", 2248], ["puzzling", 2249], ["clumsy", 2250], ["Wikipedia", 2251], ["transcribing", 2252], ["encouraging", 2253], ["listeners", 2254], ["begin", 2255], ["evaluation", 2256], ["sonnet", 2257], ["assess", 2258], ["evaluate", 2259], ["competences", 2260], ["thoughtful", 2261], ["reflecting", 2262], ["ESOL", 2263], ["physics", 2264], ["simplifying", 2265], ["Simplified", 2266], ["child", 2267], ["representation", 2268], ["narrator", 2269], ["progression", 2270], ["pratice", 2271], ["hypotheses", 2272], ["practically", 2273], ["flair", 2274], ["preferences", 2275], ["searches", 2276], ["characterizations", 2277], ["religious", 2278], ["interdisciplinary", 2279], ["Concise", 2280], ["reread", 2281], ["apostrophe", 2282], ["Punctuation", 2283], ["accessibility", 2284], ["notes", 2285], ["constraints", 2286], ["alphabetizing", 2287], ["K-6", 2288], ["fascinating", 2289], ["examine", 2290], ["practicing", 2291], ["grading", 2292], ["metaphysical", 2293], ["universally", 2294], ["altered", 2295], ["Skills", 2296], ["key", 2297], ["authorship", 2298], ["linking", 2299], ["odd", 2300], ["algorithms", 2301], ["regardless", 2302], ["hieroglyphics", 2303], ["passive", 2304], ["pervasive", 2305], ["astronomy", 2306], ["prefix", 2307], ["pre-K", 2308], ["appreciate", 2309], ["examination", 2310], ["Understand", 2311], ["comprehended", 2312], ["sociocultural", 2313], ["manuscripts", 2314], ["acquire", 2315], ["assigning", 2316], ["standards-based", 2317], ["confidence", 2318], ["presenting", 2319], ["signifiers", 2320], ["genealogical", 2321], ["inferring", 2322], ["generalized", 2323], ["identifiers", 2324], ["vocabulary-building", 2325], ["society", 2326], ["overviews", 2327], ["organisational", 2328], ["dummies", 2329], ["referent", 2330], ["user-friendly", 2331], ["constantly", 2332], ["cross-reference", 2333], ["Scrabble", 2334], ["computer", 2335], ["involve", 2336], ["self-concept", 2337], ["riddle", 2338], ["fables", 2339], ["second-grade", 2340], ["smattering", 2341], ["enunciate", 2342], ["exclamations", 2343], ["gaps", 2344], ["participation", 2345], ["gesture", 2346], ["lucid", 2347], ["requirement", 2348], ["metacognition", 2349], ["mean", 2350], ["Workbook", 2351], ["procedural", 2352], ["didactics", 2353], ["purposes", 2354], ["subtle", 2355], ["scholarship", 2356], ["needs", 2357], ["alliterations", 2358], ["typical", 2359], ["philological", 2360], ["supplemental", 2361], ["boring", 2362], ["finnish", 2363], ["thoughts", 2364], ["theoretic", 2365], ["lacked", 2366], ["socially", 2367], ["animations", 2368], ["accomplish", 2369], ["heighten", 2370], ["harder", 2371], ["spellcheck", 2372], ["confuses", 2373], ["journals", 2374], ["belief", 2375], ["explication", 2376], ["requires", 2377], ["Spanish/English", 2378], ["crafting", 2379], ["primary", 2380], ["drills", 2381], ["functions", 2382], ["prentice", 2383], ["complicate", 2384], ["introspection", 2385], ["variety", 2386], ["self-study", 2387], ["non-english", 2388], ["relying", 2389], ["integration", 2390], ["critical-thinking", 2391], ["increasingly", 2392], ["nevertheless", 2393], ["finer", 2394], ["synthesizing", 2395], ["s/he", 2396], ["Engish", 2397], ["superficial", 2398], ["kinship", 2399], ["capitalize", 2400], ["speller", 2401], ["rambling", 2402], ["adept", 2403], ["properly", 2404], ["vivid", 2405], ["digestible", 2406], ["managerial", 2407], ["rooted", 2408], ["imaginary", 2409], ["morpheme", 2410], ["treatise", 2411], ["ell", 2412], ["extant", 2413], ["enjoyment", 2414], ["lyric", 2415], ["kid", 2416], ["higher-order", 2417], ["ELA", 2418], ["synthesis", 2419], ["devotional", 2420], ["tradition", 2421], ["vocational", 2422], ["word-for-word", 2423], ["ethnography", 2424], ["chiefly", 2425], ["parentheses", 2426], ["interface", 2427], ["guideline", 2428], ["interprets", 2429], ["Speaking", 2430], ["blending", 2431], ["vulgarity", 2432], ["artistry", 2433], ["constructive", 2434], ["invariably", 2435], ["precedence", 2436], ["gardening", 2437], ["societal", 2438], ["quirks", 2439], ["contextually", 2440], ["preoccupation", 